In [41]:
# Pivot table
# pivot table in pandas is a tool to summarzie and analysze tge data
import pandas as pd

data={
    "students":["a","b","c","d","a","b","c"],
    "subjects":["Pyhton","Sql","PowerBI","Excel","Java","ML","AI"],
    "marks":[80,34,67,68,90,77,55],
    "sem":["sem-1","sem-1","sem-1","sem-2","sem-2","sem-2","sem-2"]
}

#covert above data into df
df=pd.DataFrame(data)
df

  students subjects  marks    sem
0        a   Pyhton     80  sem-1
1        b      Sql     34  sem-1
2        c  PowerBI     67  sem-1
3        d    Excel     68  sem-2
4        a     Java     90  sem-2
5        b       ML     77  sem-2
6        c       AI     55  sem-2

In [44]:
pd.pivot_table(df,values="marks",index="students",columns="subjects",aggfunc="max")

subjects    AI  Excel  Java    ML  PowerBI  Pyhton   Sql
students
a          NaN    NaN  90.0   NaN      NaN    80.0   NaN
b          NaN    NaN   NaN  77.0      NaN     NaN  34.0
c         55.0    NaN   NaN   NaN     67.0     NaN   NaN
d          NaN   68.0   NaN   NaN      NaN     NaN   NaN

In [13]:
# Group by
# group bu function is applicable with aggregate function

# print the min marks of student
df.groupby("students")['marks'].min()

students
a    80
b    34
c    55
d    68
Name: marks, dtype: int64

In [26]:
# Applying function dataframe
# apply a condition on df those who recieve marks greater than 85 they are eligible
def  eligibility(num):
    if num>=75:
        return "Eligible"
    else:
        return "Not Eligible"

df['marks'].apply(eligibility)

0        Eligible
1    Not Eligible
2    Not Eligible
3    Not Eligible
4        Eligible
5        Eligible
6    Not Eligible
Name: marks, dtype: object

In [27]:
#applying the function is dataframe
df['eligiblity']=df['marks'].apply(eligibility)
df

  students subjects  marks    sem    eligiblity
0        a   pyhton     80  sem-1      Eligible
1        b      Sql     34  sem-1  Not Eligible
2        c  PowerBI     67  sem-1  Not Eligible
3        d    Excel     68  sem-2  Not Eligible
4        a     Java     90  sem-2      Eligible
5        b       ML     77  sem-2      Eligible
6        c       AI     55  sem-2  Not Eligible

In [53]:
# Date
# how can we generate a date range by using the pandas.
# syntax is --> pd.date_range(start_date,periods,freq=D,min,H)


# Create date range from 01/01/2026to 30/01/2026
range=pd.date_range("10-01-2026",periods=20,freq="D")
range

DatetimeIndex(['2026-10-01', '2026-10-02', '2026-10-03', '2026-10-04',
               '2026-10-05', '2026-10-06', '2026-10-07', '2026-10-08',
               '2026-10-09', '2026-10-10', '2026-10-11', '2026-10-12',
               '2026-10-13', '2026-10-14', '2026-10-15', '2026-10-16',
               '2026-10-17', '2026-10-18', '2026-10-19', '2026-10-20'],
              dtype='datetime64[ns]', freq='D')

In [57]:
# df.shape(row,colunms)
# df.size
# df.['col_name']--> aceess the column
#df[[col1,col2,col3]]--> access the multiple columns
# df.duplicate(sum) -->check the duplicates.
# df.['col'].value_counts()--> check the frequency of the values.
# df.isnull().sum()--> to check the sum of null values.
# df.loc[start:end:step]
# df.iloc[row_index,col_index]
# df.dropna[how="any/all",axis=0/1,inplace=True,thresh] -->
# df.fillna(value1,method ,limit,inplace) drop null values
# df.merge(df1,df2,"how=left/right/outer")
# df.['col'].apply(func_name)
# pf.date_range(start,periods,freq)

SyntaxError: invalid syntax (745885827.py, line 11)